In [5]:
import pandas as pd
import numpy as np

a= ["Apple","Banana","Cherry","Apple"]
b= [3,4,7,3]
c= [5,4,1,4]
d= [7,8,3,7]

df = pd.DataFrame(columns =  ['Column1','Column2','Column3','Column4'])
#df.columns =  ['Column1','Column2','Column3','Column4']

df["Column1"]=a
df["Column2"]=b
df["Column3"]=c
df["Column4"]=d

df

  Column1  Column2  Column3  Column4
0   Apple        3        5        7
1  Banana        4        4        8
2  Cherry        7        1        3
3   Apple        3        4        7

In [30]:
result = df.groupby(['Column1'], as_index=False).agg({'Column3':['mean','std']})
result

  Column1 Column3
             mean       std
0   Apple     4.5  0.707107
1  Banana     4.0       NaN
2  Cherry     1.0       NaN

In [25]:
result.columns

MultiIndex([('Column1',     ''),
            ('Column3', 'mean'),
            ('Column3',  'std')],
           )

In [27]:
result['Column3', 'Cv'] = result['Column3', 'std']/abs(result['Column3', 'mean'])
print(result)

  Column1 Column3
             mean       std        Cv
0   Apple     4.5  0.707107  0.157135
1  Banana     4.0       NaN       NaN
2  Cherry     1.0       NaN       NaN

#### <font color=blue> Alternate Way

In [12]:

grouped = df.groupby('Column1')

df_mean = grouped.apply(np.mean)

df_std = grouped.apply(np.std)

print(df_mean)
print('\n')
print(df_std)

         Column2  Column3  Column4
Column1
Apple        3.0      4.5      7.0
Banana       4.0      4.0      8.0
Cherry       7.0      1.0      3.0


         Column2  Column3  Column4
Column1
Apple        0.0      0.5      0.0
Banana       0.0      0.0      0.0
Cherry       0.0      0.0      0.0